# -*- coding: utf-8 -*-
let_orig = [
["А","а"],
["Ә","ә"],
["Б","б"],
["В","в"],
["Г","г"],
["Ғ","ғ"],
["Д","д"],
["Е","е"],
["Ё","ё"],
["Ж","ж"],
["З","з"],
["И","и"],
["Й","й"],
["К","к"],
["Қ","қ"],
["Л","л"],
["М","м"],
["Н","н"],
["Ң","ң"],
["О", "о"],
["Ө", "ө"],
["П", "п"],
["Р", "р"],
["С", "с"],
["Т", "т"],
["У", "у"],
["Ұ", "ұ"],
["Ү", "ү"],
["Ф", "ф"],
["Х", "х"],
["Һ", "һ"],
["Ц", "ц"],
["Ч", "ч"],
["Ш", "ш"],
["Щ", "щ"],
["Ъ", "ъ"],
["Ы", "ы"],
["І", "і"],
["Ь", "ь"],
["Э", "э"],
["Ю", "ю"],
["Я", "я"]
]

rep_new = [
["A","a"],
["Á","á"],
["B","b"],
["D","d"],
["E","e"],
["F","f"],
["G","g"],
["Ǵ","ǵ"],
["H","h"],
["I","i"],
["I","ı"],
["J","j"],
["K","k"],
["L","l"],
["M","m"],
["N","n"],
["Ń","ń"],
["O","o"],
["Ó","ó"],
["P","p"],
["Q","q"],
["R","r"],
["S","s"],
["T","t"],
["U","u"],
["Ú","ú"],
["V","v"],
["Y","y"],
["Ý","ý"],
["Z","z"],
["Sh","sh"],
["Ch","ch"]
]

replacement_indexes = [
[0,0],
[1,1],
[2,2],
[3,26],
[4,6],
[5,7],
[6,3],
[7,4],
[8,4],
[9,11],
[10,29],
[11,10],
[12,10],
[13,12],
[14,20],
[15,13],
[16,14],
[17,15],
[18,16],
[19,17],
[20,18],
[21,19],
[22,21],
[23,22],
[24,23],
[25,28],
[26,24],
[27,25],
[28,5],
[29,8],
[30,8],
[31,"?"],
[32,31],
[33,30],
[34,"?"],
[35,"?"],
[36,27],
[37,9],
[38,"?"],
[39,"?"],
[40,"?"],
[41,"?"]
]

#text_a = "Барлық адамдар тумасынан азат және қадыр-қасиеті мен құқтары тең болып дүниеге келеді. Адамдарға ақыл-парасат, ар-ождан берілген, сондықтан олар бір-бірімен туыстық, бауырмалдық қарым-қатынас жасаулары тиіс."
text_a = '''Орнату барлық қолданбаларды автоматты түрде жаба алмады. Жалғастырмас бұрын Орнатуды пайдаланып, барлық қолданбаларды жабу ұсынылады.'''
#
new_text = ''
#
def get_nested_index(ll, l):
	#
	i = 0 
	#
	for x in ll:
		#
		#
		if l in x:
			#
			#print(ll[i],x, i)
			return i
			#
		#
		i = i + 1
	#
#
for l in text_a:
	#
	all_l = [item for sublist in let_orig for item in sublist]
	#
	print(all_l)
	#
	if l in all_l:
		#
		o_l_index = get_nested_index(let_orig, l)
		#
		rep_l = replacement_indexes[o_l_index][1]
		#
		if rep_l != "?":
			#
			#print('missing',l)
			#
			do_rep_i = rep_l
			#
		else:
			#
			do_rep_i = 0
			#
		#
		if l.isupper():
			#
			fin_rep = rep_new[do_rep_i][0]
			#
		else:
			#
			fin_rep = rep_new[do_rep_i][1]
			#
		#
		new_text = new_text + fin_rep
		#
	else:
		#
		new_text = new_text + l
		#
print(text_a)
print('---')
print(new_text)

